[AdventCaptainArmor X2ArmorTemplate]
FriendlyName="ADVENT Officer Armor"
FriendlyNamePlural="ADVENT Officer Armors"
BriefSummary="The ADVENT Officer armor is a direct upgrade over the Trooper armor as it maintains the Deception ability while offering a few improvements. The torso is reinforced with metal plates that grant better protection and contain an internal compartment to store an additional item. Aside from requiring Officer corpses, the suit can be refurbished at a marginal increase in material costs, making it the more appealing proposition."
TacticalText="<Bullet/>Soldiers may take advantage of scavenged ADVENT Officer gear in combat. Additionally, we may catch our enemy off guard with this new armor."


[AdventCaptainArmorDetectionStat X2AbilityTemplate]
LocFriendlyName="Deception"
LocLongDescription="ADVENT will be less likely to detect this soldier during initial contact."
LocHelpText="ADVENT will be less likely to detect this soldier during initial contact."
LocFlyOverText="ADVENT will be less likely to detect this soldier during initial contact."
LocPromotionPopupText="<Bullet/> ADVENT will be less likely to detect this soldier during initial contact."


[AdventCaptainArmorUniquePassive X2AbilityTemplate]
LocFriendlyName="Internal Compartment "
LocLongDescription="The ADVENT Officer's armor contains an internal compartment to store an additional item."
LocHelpText="The ADVENT Officer's armor contains an internal compartment to store an additional item."
LocFlyOverText="The ADVENT Officer's armor contains an internal compartment to store an additional item."
LocPromotionPopupText="<Bullet/> The ADVENT Officer's armor contains an internal compartment to store an additional item."